{
    "About": "The DND Helper is a companion tool modeled after D&D 5th edition's character format. It is designed to assist players in organizing their characters and streamline the rolling process for newer players.\n\nThe app makes use of two open REST APIs, found at the links at the bottom of the description. These APIs are limited in scope, but they cover a majority of the D&D 5e base rulebook. This rulebook has been made free and available by Wizards of the Coast, and can be found at their website. Please check back for newer features, especially those catered towards DMs and encounter planning/organization.\n\n\n\nAPI 1:http://www.dnd5eapi.co/api/\nAPI 2:https://api.open5e.com/\nRulebook:https://dnd.wizards.com/articles/features/basicrules",
    
    
    "Use": "This app is intended to assist new players and returning players in character creation. The base window supports creating and opening character sheets from file, editing them, and then saving them. Multiple files may be opened at once. The application will additionally remind the user of which fields were changed. Additionally, the character editor can auto-calculate stats and assist in rolling, which is talked about more in the 'Format' tab.\n\nUnfortunately, due to the complexity of spells, an auto-roll feature is not yet implemented for spellcasters. The feature is currently limited to skills and weapons.\n\nEach dock widget, found in the 'Window' tab, provides an extension of the character-creating and character-playing process. These widgets allow the player to quickly look up creatures, items, etc, or keep track of the initiative order. These are not required for the character creator, but they may be useful in a tabletop game.",
    
    
    
    "Format": "In order for the auto-rolling and auto-calculating stats to function properly, character forms must follow a specific format, as detailed below.\n\n> Stats: stats must follow a strict integer-only format\n> Mods: modifiers must be integer-only, or negative integers indicated by a '-'\n> Stat References: stat references, like the spellcasting stat, must use the 3-letter abbreviation for the corresponding stat (such as CHA for charisma)\n> Dice: any damage dice (like the weapon damage field) must be given in the format _d_. For example, 3d4. Modifiers are handled separately. For multiple dice, separate each by a semicolon, like 3d4;3d6.\n> Proficiency: proficiency is tri-state to account for half-proficiency. A block is treated as full proficiency and a check is half-proficient. Empty is no proficiency."

}
